<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 缓存设置
// +----------------------------------------------------------------------

return [
    // 驱动方式
    'type'   => env('cache_driver','File'),
    // 缓存保存目录
    'path'   => '',
    // 缓存前缀
    'prefix' => env('app_id','').'_',
    // 缓存有效期 0表示永久缓存
    'expire' => env('cache_expire',0),
    // 服务器地址
    'host'   => env('cache_host','127.0.0.1'),
    // redis端口
    'port'       => env('cache_port',6379),
    // 密码
    'password'   => env('cache_password',''),
];
